# Data Preprocessing Steps:

## Import the libraries

In [75]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from sklearn import preprocessing
from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer

## Import and examine the dataset
- Do we have any missing values?
- Show the dataframe sorted by State
- Show the means of numeric features by State
- Compute the min, max and mean of Salary and Age by state

Use a many cells as needed to show your work

[Dataset.csv](https://drive.google.com/file/d/1Sq7OQ-jMWFlF6Zamz5_RmIvjUt9d1THb/view?usp=sharing)

In [76]:
#read the file
df = pd.read_csv("./Dataset.csv")

In [77]:
df.head()

          State   Salary   Age Paid_back
0      New York  80000.0  35.0       Yes
1    New Jersey  60000.0  47.0       Yes
2  Pennsylvania  50000.0  61.0        No
3    New Jersey      NaN  29.0        No
4    New Jersey  90000.0  70.0        No

In [78]:
df

          State   Salary   Age Paid_back
0      New York  80000.0  35.0       Yes
1    New Jersey  60000.0  47.0       Yes
2  Pennsylvania  50000.0  61.0        No
3    New Jersey      NaN  29.0        No
4    New Jersey  90000.0  70.0        No
5      New York  40000.0  37.0       Yes
6  Pennsylvania  56000.0  30.0       Yes
7      New York  85000.0   NaN        No
8  Pennsylvania  42000.0  50.0       Yes
9    New Jersey  72000.0  42.0       Yes

In [79]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   State      10 non-null     object
 1   Salary     9 non-null      float64
 2   Age        9 non-null      float64
 3   Paid_back  10 non-null     object
dtypes: float64(2), object(2)
memory usage: 452.0+ bytes

In [80]:
df.describe()

             Salary        Age
count      9.000000   9.000000
mean   63888.888889  44.555556
std    18617.494759  13.974183
min    40000.000000  29.000000
25%    50000.000000  35.000000
50%    60000.000000  42.000000
75%    80000.000000  50.000000
max    90000.000000  70.000000

In [81]:
#check for missing values
print("Missing values per column:\n", df.isnull().sum())

Missing values per column:
 State        0
Salary       1
Age          1
Paid_back    0
dtype: int64

In [82]:
# Sort by the 'State' column
dfSorted = df.sort_values(by="State")
print("\n DataFrame Sorted by State: \n", dfSorted)

 DataFrame Sorted by State:
           State   Salary   Age Paid_back
1    New Jersey  60000.0  47.0       Yes
3    New Jersey      NaN  29.0        No
4    New Jersey  90000.0  70.0        No
9    New Jersey  72000.0  42.0       Yes
0      New York  80000.0  35.0       Yes
5      New York  40000.0  37.0       Yes
7      New York  85000.0   NaN        No
2  Pennsylvania  50000.0  61.0        No
6  Pennsylvania  56000.0  30.0       Yes
8  Pennsylvania  42000.0  50.0       Yes

In [83]:
# Means of numeric columns grouped by the 'State'
meansByState = df.groupby("State").mean(numeric_only=True)
print("\n Means of Numeric Features by State: \n", meansByState)

 Means of Numeric Features by State:
                     Salary   Age
State
New Jersey    74000.000000  47.0
New York      68333.333333  36.0
Pennsylvania  49333.333333  47.0

In [84]:
# Using groupby to compute multiple aggregate stats
statsByState = df.groupby("State")[["Salary", "Age"]].agg(["min", "max", "mean"])
print("\nMin, Max, and Mean of Salary and Age by State:\n", statsByState)

Min, Max, and Mean of Salary and Age by State:
                Salary                          Age
                  min      max          mean   min   max  mean
State
New Jersey    60000.0  90000.0  74000.000000  29.0  70.0  47.0
New York      40000.0  85000.0  68333.333333  35.0  37.0  36.0
Pennsylvania  42000.0  56000.0  49333.333333  30.0  61.0  47.0

## Take Care of missing data
1.  Delete rows with missing data, or
2.  Replace missing data with mean values.

In [85]:

#delete rows with missing data
print(df.shape)
#drop rows with missing values
dfRvMissing = df.dropna()
#summarize the shape of the data with missing rows removed
print(dfRvMissing.shape)

(10, 4)
(8, 4)

## Encode Categorical data

#### Encode and display the categorical Independent Variable

In [86]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   State      10 non-null     object
 1   Salary     9 non-null      float64
 2   Age        9 non-null      float64
 3   Paid_back  10 non-null     object
dtypes: float64(2), object(2)
memory usage: 452.0+ bytes

In [87]:
df.head()

          State   Salary   Age Paid_back
0      New York  80000.0  35.0       Yes
1    New Jersey  60000.0  47.0       Yes
2  Pennsylvania  50000.0  61.0        No
3    New Jersey      NaN  29.0        No
4    New Jersey  90000.0  70.0        No

In [88]:
numericColumns = ['Salary','Age']

In [89]:
df['Paid_back'].unique()

array(['Yes', 'No'], dtype=object)

In [90]:
#get_dummies method to encode categorical features
df = pd.get_dummies(df,columns=["Paid_back"],dtype = 'int')

In [91]:
df

          State   Salary   Age  Paid_back_No  Paid_back_Yes
0      New York  80000.0  35.0             0              1
1    New Jersey  60000.0  47.0             0              1
2  Pennsylvania  50000.0  61.0             1              0
3    New Jersey      NaN  29.0             1              0
4    New Jersey  90000.0  70.0             1              0
5      New York  40000.0  37.0             0              1
6  Pennsylvania  56000.0  30.0             0              1
7      New York  85000.0   NaN             1              0
8  Pennsylvania  42000.0  50.0             0              1
9    New Jersey  72000.0  42.0             0              1

In [92]:
catColumns= ['Paid_back_No','Paid_back_Yes']
ind_columns= numericColumns + catColumns

#### Encode and display the Dependent Variable

In [93]:
df['State'].unique()

array(['New York', 'New Jersey', 'Pennsylvania'], dtype=object)

In [94]:
df["label"] = np.where(df["State"].str.contains("New Jersey"), 1, 0)
df

          State   Salary   Age  Paid_back_No  Paid_back_Yes  label
0      New York  80000.0  35.0             0              1      0
1    New Jersey  60000.0  47.0             0              1      1
2  Pennsylvania  50000.0  61.0             1              0      0
3    New Jersey      NaN  29.0             1              0      1
4    New Jersey  90000.0  70.0             1              0      1
5      New York  40000.0  37.0             0              1      0
6  Pennsylvania  56000.0  30.0             0              1      0
7      New York  85000.0   NaN             1              0      0
8  Pennsylvania  42000.0  50.0             0              1      0
9    New Jersey  72000.0  42.0             0              1      1

## Split the dataset into training and testing sets

In [95]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   State          10 non-null     object
 1   Salary         9 non-null      float64
 2   Age            9 non-null      float64
 3   Paid_back_No   10 non-null     int64
 4   Paid_back_Yes  10 non-null     int64
 5   label          10 non-null     int64
dtypes: float64(2), int64(3), object(1)
memory usage: 612.0+ bytes

In [96]:
# Store relevant columns as variables
X = df[ind_columns].values
# Create a 1-D numpy array
y = df[['label']].values.ravel()

In [97]:
X.shape

(10, 4)

In [98]:
y.shape

(10,)

In [99]:
type(df[ind_columns].values)

numpy.ndarray

In [100]:
trainX,testX,trainY,testY = train_test_split(X, y, test_size=.2, random_state=42)
print('Split X: ',trainX.shape, testX.shape)
print('Split Y: ',trainY.shape, testY.shape)

Split X:  (8, 4) (2, 4)
Split Y:  (8,) (2,)

## Feature Scaling

#### Standardized Scaling
* Scale the numerical features using standardized scaling
* Show your work

In [101]:
original = df[numericColumns]
# Standardize dataframe and return as an array
standardizedArray = preprocessing.scale(original)

# Convert standardized array to dataframe 'standardized'
standardized = pd.DataFrame(standardizedArray, columns=numericColumns)

In [102]:
standardized

     Salary       Age
0  0.917869 -0.725280
1 -0.221554  0.185537
2 -0.791266  1.248157
3       NaN -1.180689
4  1.487580  1.931269
5 -1.360978 -0.573477
6 -0.449439 -1.104787
7  1.202724       NaN
8 -1.247035  0.413241
9  0.462099 -0.193970

#### Normalized Scaling
* Scale the numerical features using normalized scaling
* Show your work

In [103]:
# Normalize dataframe and return as an array
normalizedArray = preprocessing.MinMaxScaler().fit_transform(df[numericColumns])

# Convert normalized array to dataframe 'normalized'
normalized = pd.DataFrame(normalizedArray, columns=numericColumns)
normalized

   Salary       Age
0    0.80  0.146341
1    0.40  0.439024
2    0.20  0.780488
3     NaN  0.000000
4    1.00  1.000000
5    0.00  0.195122
6    0.32  0.024390
7    0.90       NaN
8    0.04  0.512195
9    0.64  0.317073